[
    {
        "id" : "MMOAT",
        "nom" : "MMO (En cours)",
        "desc" : "MMO réalisé en binome dans le cadre de ma deuxième année de Master. Le projet implémente un système de magie et de compétences. Ce système m'a permis de me familiariser avec le Gameplay Ability System (GAS) de UE5. On y trouve aussi un inventaire dynamique et un système de collectibles. Un système de pêche est actuellement en cours de réalisation. Comme il s'agit d'un MMO, nous travaillons à réaliser le jeu de manière à le rendre compatible au multijoueur.",
        "dateDebut": "Septembre - 2024",
        "dateFin": "En cours"
    },
    {
        "id" : "FishClicker",
        "nom" : "FishClicker",
        "desc" : "Projet de \"Mobilité\" (application mobile) réalisé durant mon second semestre de Master 2. Le but était de créer un jeu dont l'usage sur mobile était justifié. Nous avons donc décidé de partir sur la base d'un clicker ancré dans l'univers de la pêche. Ce projet nous a donc permis de réfléchir aux avantages et inconvénients d'un jeu sur téléphone. Via ce projet, j'ai appris à utiliser l'accéléromètre du téléphone via Unity pour détecter lorsque le téléphone est secoué. J'ai aussi pu apprendre à faire vibrer le téléphone quand l'utilisateur échoue une pêche.",
        "dateDebut": "Février - 2025",
        "dateFin": "Mars - 2025"
    },
    {
        "id" : "Path finding, Hospital (IA)",
        "nom" : "Path finding, Hospital (IA)",
        "desc" : "Suite du projet de pilotage pour IA. À l'aide de la librairie précédemment créée, j'ai pu développer un jeu où le joueur doit, en collaboration avec des IA, aller chercher des personnes bléssées sur la route et les ramener à l'hôpital. La map est générée aléatoirement (excepté pour les contours de la map) avec une route cohérente et l'hôpital au centre.  De plus, il nous était interdit de faire communiquer les IA entre elles. Via ce projet, j'ai pu améliorer ma compréhension des IA dans le jeu vidéo en cherchant à passer outre ces contraintes.",
        "dateDebut": "Fevrier - 2025",
        "dateFin": "Mars - 2025"
    },
    {
        "id" : "Steering",
        "nom" : "Librairie de pilotage pour IA",
        "desc" : "Projet d'implémentation d'une bibliothèque de \"Steering Behaviors\" sur Unreal Engine 5, simulant des comportements de déplacement pour une IA sous forme de cône. L'IA peut poursuivre, fuir, suivre un chemin ou s'arrêter progressivement, avec des cibles dynamiques et des contrôles interactifs. Le projet à été réalisé pour la première partie du deuxième semestre de Master 2.",
        "dateDebut": "Janvier - 2025",
        "dateFin": "Fevrier - 2025"
    },
    {
        "id" : "Point&Click",
        "nom" : "Éditeur de Point&Click",
        "desc" : "Projet réalisé en trinôme sur Unity en tant que projet de Master 1 pour le premier semestre. Il s'agit d'un éditeur de jeu de type Point&Click où l'utilisateur peut créer son propre jeu en plaçant des objets et en créant des interactions entre eux. Le projet permet la création et la lecture de jeux personnalisés grâce à une structure de données en JSON, ainqi qu'un éditeur intuitif pour concevoir personnages, objets, dialogues et quêtes. Il a été implémenté collaborativement via Plastic SCM",
        "dateDebut": "Avril - 2024",
        "dateFin": "Juillet - 2024"
    },
    {
        "id" : "Pachinko",
        "nom" : "Pachinko Unity",
        "desc" : "Projet réalisé lors de ma formation en ligne sur Unity durant le parcours Unity Essentials. Il s'agit d'un jeu de Pachinko où le joueur doit faire apparaître une bille en haut d'un plateau pour obtenir un maximum de points. Le jeu est composé d'un système de score et est jouable en ligne.",
        "dateDebut": "Avril - 2024",
        "dateFin": "Avril - 2024"
    },
    {
        "id" : "AppMandela",
        "nom" : "Application android qui indique les différentes maraudes présentes dans la région",
        "desc" : "Application réalisée dans le cadre de mon stage de Licence 3. Elle a été réalisée en même temps qu'un site internet. Elle permettait d'enregistrer les différentes maraudes présentes dans la région à condition d'être acceptées par un membre de l'association \"Les Amis de Mandela\" basée à l'AFERTES d'Avion. Elle implémentait un système de compte pour les partenaires désirant proposer leurs maraudes sur l'application. Le projet a été abandonné par la suite.",
        "dateDebut": "Avril - 2023",
        "dateFin": "Juillet - 2023"
    },
    {
        "id" : "Sokoban",
        "nom" : "Sokoban",
        "desc" : "Premier projet de jeu vidéo réalisé en Python dans le cadre de ma première année de DUT, ce Sokoban propose une version revisitée du jeu classique. Les joueurs doivent compléter trois niveaux successifs, et chaque niveau ne devient accessible qu'une fois le précédent terminé. Un boutton de réinitialisation permet de bloquer de nouveau l'accès aux niveaux, ce qui ajoute un élément de flexibilité et de défi.",
        "dateDebut": "Avril - 2020",
        "dateFin": "Mai - 2020"
    }
]