[
    {
      "id": "MMOAT",
      "nom": "MMO",
      "desc": "MMO project done in pair as part of my second year of Master. The project implements a system of magic and skills. This system allowed me to get familiar with Unreal Engine 5’s Gameplay Ability System (GAS). It also features a dynamic inventory and a collectible system. A fishing system is currently being developed. Since it's an MMO, we are working to make the game multiplayer-compatible.",
      "dateDebut": "September - 2024",
      "dateFin": "Work In Progress"
    },
    {
      "id": "FishClicker",
      "nom": "FishClicker",
      "desc": "Mobile project completed during my second semester of Master 2. The goal was to create a game where the mobile experience was essential. This project helped us consider the advantages and drawbacks of mobile gaming. Through this project, I learned how to use the phone's accelerometer in Unity to detect when the phone is shaken. I also learned how to make the phone vibrate when the user fails to catch a fish.",
      "dateDebut": "February - 2025",
      "dateFin": "March - 2025"
    },
    {
      "id": "Path finding, Hospital (IA)",
      "nom": "Pathfinding, Hospital (AI)",
      "desc": "Continuation of the AI navigation project. Using a previously created library, I developed a game where the player must work with AI to retrieve injured people from the road and bring them to the hospital. The map is randomly generated (except for the map borders) : it has a coherent path with the hospital at the center. We were prohibited from having the AIs communicate with each other. This project helped me improve my understanding of AI in video games while working around these constraints.",
      "dateDebut": "February - 2025",
      "dateFin": "March - 2025"
    },
    {
      "id": "Steering",
      "nom": "AI Steering Library",
      "desc": "Project to implement a library of 'Steering Behaviors' in Unreal Engine 5, simulating movement behaviors for AI in the form of a cone. The AI can pursue, flee, follow a path, or stop gradually, with dynamic targets and interactive controls. This project was completed during the first part of the second semester of Master's 2.",
      "dateDebut": "January - 2025",
      "dateFin": "February - 2025"
    },
    {
      "id": "Point&Click",
      "nom": "Point&Click Editor",
      "desc": "Project completed in a team of three on Unity as part of the Master 1 project for the first semester. This is a Point&Click game editor where users can create their own game by placing objects and creating interactions between them. The project allows the creation and playing of custom games through a JSON data structure, as well as an intuitive editor for designing characters, objects, dialogues, and quests. The project was implemented collaboratively via Plastic SCM.",
      "dateDebut": "April - 2024",
      "dateFin": "July - 2024"
    },
    {
      "id": "Pachinko",
      "nom": "Pachinko Unity",
      "desc": "Project developed during my online training in Unity as part of the Unity Essentials course. It is a Pachinko game where the player has to drop a ball at the top of a board to score as many points as possible. The game includes a scoring system and is playable online.",
      "dateDebut": "April - 2024",
      "dateFin": "April - 2024"
    },
    {
      "id": "AppMandela",
      "nom": "Android Application for Tracking Outreach Events in the Region",
      "desc": "Application developed during my third-year internship. It was created alongside a website. It allowed users to record different outreach events in the region, provided they were approved by a member of the 'Les Amis de Mandela' association based at AFERTES in Avion. It included an account system for partners wishing to post their outreach events. The project was later abandoned.",
      "dateDebut": "April - 2023",
      "dateFin": "July - 2023"
    },
    {
      "id": "Sokoban",
      "nom": "Sokoban",
      "desc": "First video game project created in Python during my first year of DUT. This Sokoban game offers a revamped version of the classic game. Players must complete three successive levels, with each level becoming accessible only after completing the previous one. A reset function allows blocking access to previous levels again, adding flexibility and challenge.",
      "dateDebut": "April - 2020",
      "dateFin": "May - 2020"
    }
  ]
  